app/views/search/_list.html.erb

					<div class="medium-3 columns" data-turbolinks="false">
						<% rental.images.each do |image| %>
---
SELECT "images".* FROM "images" WHERE "images"."rental_id" = ?  [["rental_id", 1]]

							<% @num_reviews = 0 %>
							<% rental.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."rental_id" = ?  [["rental_id", 1]]