app/views/rentals/index.html.erb

SELECT "rentals".* FROM "rentals"
---
<!-- Calculates the top rentals by overall rating -->
<% @top_rentals = Rental.all %>

SELECT "images".* FROM "images" WHERE "images"."rental_id" = ?  [["rental_id", 1]]
---
               <div id="rental_image" data-turbolinks="false">
                  <% rental.images.each do |image| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."rental_id" = ?  [["rental_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."rental_id" = ?  [["rental_id", 3]]
---
                  <div id="index_header2">
                     <%= rental.reviews.count %>