app/views/rentals/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."rental_id" = ?  [["rental_id", 1]]
---
<% @num_reviews = 0 %>
<% @rental.reviews.each do |review| %>

SELECT "images".* FROM "images" WHERE "images"."rental_id" = ?  [["rental_id", 1]]
---
		<div id="owl-carousel" class="owl-carousel">
			<% @rental.images.each do |image| %>