app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals"
---
  def index
    @rental = Rental.new
    @filterrific = initialize_filterrific(
    	Rental,
   		params[:filterrific]
  	) or return
		@rentals = Rental.all

INSERT INTO "rentals" ("rental_listing", "addr_street_name", "phone_number", "addr_street_num", "addr_zip", "addr_city", "addr_state", "dets_description", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "images" ("pic_file_name", "pic_content_type", "pic_file_size", "pic_updated_at", "default", "rental_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rental = Rental.new(rental_params)

    respond_to do |format|
      if @rental.save

        # saving images with paperclip
        if params[:pics]
          params[:pics].each { |pic|
            # XXX this sets all default to true once can figure out
            # ajax to return file to be defult remove
            @rental.images.create(pic: pic, default: true)

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_rental
      @rental = Rental.find(params[:id])