app/controllers/reviews_controller.rb

  def create
    @rental = Rental.find params[:rental_id]
    @review = @rental.reviews.new(review_params)
    @review.user = current_user

    respond_to do |format|
      if @review.save

        # saving images with paperclip
        if params[:pics]
          params[:pics].each { |pic|
            @rental.images.create(pic: pic)
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "reviews" ("overall", "comment", "rental_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["overall", 5], ["price", 1], ["comment", "The best board ever"], ["rental_id", 10], ["user_id", 10], ["created_at", "2017-04-23 20:31:36.330002"], ["updated_at", "2017-04-23 20:31:36.330002"]]
INSERT INTO "images" ("pic_file_name", "pic_content_type", "pic_file_size", "pic_updated_at", "rental_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)