app/controllers/search_controller.rb

SELECT "rentals".* FROM "rentals"  ORDER BY LOWER(dets_baths)
---
		def show
			@rental = Rental.new
			@filterrific = initialize_filterrific(
				Rental,
				params[:filterrific],

				select_options: {
				search_query:	Rental.search

						}
				) or return